<?php
// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => env('CACHE_DRIVER', 'file'),
    // 缓存连接配置
    'stores' => [
        'file' => [
            // 驱动类型
            'type' => 'File',
            // 缓存保存目录
            'path' => '',
            // 缓存前缀
            'prefix' => '',
            // 缓存有效期 0 为永久
            'expire' => 0,
            // 缓存标签
            'tag_prefix' => '',
            // 缓存数据长度
            'length' => 0,
        ],
        'redis' => [
            // 驱动类型
            'type' => 'redis',
            // 缓存连接
            'select' => env('CACHE_REDIS_DATABASE', 0),
            // 缓存前缀
            'prefix' => env('CACHE_PREFIX', ''),
            // 缓存有效期 0 为永久
            'expire' => 0,
            // 缓存标签
            'tag_prefix' => '',
            // 缓存数据长度
            'length' => 0,
        ],
    ],
];
