<?php
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------

return [
    // 默认日志通道
    'default' => 'file',
    // 日志通道列表
    'channels' => [
        'file' => [
            // 日志记录方式
            'type' => 'file',
            // 日志保存目录
            'path' => '',
            // 单文件日志写入
            'single' => false,
            // 独立日志级别
            'apart_level' => [],
            // 最大日志文件数量
            'max_files' => 30,
            // 日志输出格式化
            'format' => '[%s][%s] %s',
            // 是否实时写入
            'realtime_write' => true,
        ],
    ],
    // 全局日志处理 支持闭包
    'processor' => null,
];
